experiments/workflow/boki-hotel/expected_results/qps100/wrk_warmup.log
Running 30s test @ http://ip-172-31-7-164.us-east-2.compute.internal:8080
  2 threads and 2 connections
  Thread calibration: mean lat.: 8.211ms, rate sampling interval: 81ms
  Thread calibration: mean lat.: 7.837ms, rate sampling interval: 49ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     6.82ms   13.19ms  48.70ms   83.28%
    Req/Sec    50.14     18.87   104.00     79.94%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    0.95ms
 75.000%    1.38ms
 90.000%   25.15ms
 99.000%   44.96ms
 99.900%   44.99ms
 99.990%   48.74ms
 99.999%   48.74ms
100.000%   48.74ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.259     0.000000            1         1.00
       0.474     0.100000          200         1.11
       0.585     0.200000          402         1.25
       0.717     0.300000          600         1.43
       0.829     0.400000          800         1.67
       0.951     0.500000         1000         2.00
       1.032     0.550000         1100         2.22
       1.095     0.600000         1199         2.50
       1.144     0.650000         1300         2.86
       1.221     0.700000         1399         3.33
       1.378     0.750000         1499         4.00
       5.055     0.775000         1549         4.44
       5.259     0.800000         1602         5.00
       5.331     0.825000         1649         5.71
      24.895     0.850000         1709         6.67
      24.959     0.875000         1750         8.00
      25.119     0.887500         1775         8.89
      25.151     0.900000         1801        10.00
      25.183     0.912500         1825        11.43
      44.703     0.925000         1893        13.33
      44.703     0.937500         1893        16.00
      44.703     0.943750         1893        17.78
      44.735     0.950000         1917        20.00
      44.735     0.956250         1917        22.86
      44.927     0.962500         1956        26.67
      44.927     0.968750         1956        32.00
      44.927     0.971875         1956        35.56
      44.927     0.975000         1956        40.00
      44.927     0.978125         1956        45.71
      44.959     0.981250         1988        53.33
      44.959     0.984375         1988        64.00
      44.959     0.985938         1988        71.11
      44.959     0.987500         1988        80.00
      44.959     0.989062         1988        91.43
      44.959     0.990625         1988       106.67
      44.959     0.992188         1988       128.00
      44.959     0.992969         1988       142.22
      44.959     0.993750         1988       160.00
      44.959     0.994531         1988       182.86
      44.991     0.995313         1997       213.33
      44.991     0.996094         1997       256.00
      44.991     0.996484         1997       284.44
      44.991     0.996875         1997       320.00
      44.991     0.997266         1997       365.71
      44.991     0.997656         1997       426.67
      44.991     0.998047         1997       512.00
      44.991     0.998242         1997       568.89
      44.991     0.998437         1997       640.00
      44.991     0.998633         1997       731.43
      44.991     0.998828         1997       853.33
      44.991     0.999023         1997      1024.00
      44.991     0.999121         1997      1137.78
      44.991     0.999219         1997      1280.00
      44.991     0.999316         1997      1462.86
      44.991     0.999414         1997      1706.67
      48.735     0.999512         1998      2048.00
      48.735     1.000000         1998          inf
#[Mean    =        6.818, StdDeviation   =       13.187]
#[Max     =       48.704, Total count    =         1998]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%  234.00us
 75.000%  264.00us
 90.000%  299.00us
 99.000%   44.03ms
 99.900%   44.06ms
 99.990%   47.87ms
 99.999%   47.87ms
100.000%   47.87ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.116     0.000000            1         1.00
       0.168     0.100000          200         1.11
       0.187     0.200000          409         1.25
       0.203     0.300000          611         1.43
       0.221     0.400000          811         1.67
       0.234     0.500000         1004         2.00
       0.241     0.550000         1101         2.22
       0.247     0.600000         1214         2.50
       0.252     0.650000         1300         2.86
       0.258     0.700000         1413         3.33
       0.264     0.750000         1499         4.00
       0.268     0.775000         1551         4.44
       0.272     0.800000         1612         5.00
       0.276     0.825000         1651         5.71
       0.281     0.850000         1699         6.67
       0.288     0.875000         1754         8.00
       0.292     0.887500         1775         8.89
       0.299     0.900000         1800        10.00
       0.318     0.912500         1824        11.43
      43.775     0.925000         1850        13.33
      43.871     0.937500         1885        16.00
      43.903     0.943750         1905        17.78
      43.903     0.950000         1905        20.00
      43.935     0.956250         1925        22.86
      43.935     0.962500         1925        26.67
      43.967     0.968750         1951        32.00
      43.967     0.971875         1951        35.56
      43.967     0.975000         1951        40.00
      43.999     0.978125         1974        45.71
      43.999     0.981250         1974        53.33
      43.999     0.984375         1974        64.00
      43.999     0.985938         1974        71.11
      43.999     0.987500         1974        80.00
      44.031     0.989062         1993        91.43
      44.031     0.990625         1993       106.67
      44.031     0.992188         1993       128.00
      44.031     0.992969         1993       142.22
      44.031     0.993750         1993       160.00
      44.031     0.994531         1993       182.86
      44.031     0.995313         1993       213.33
      44.031     0.996094         1993       256.00
      44.031     0.996484         1993       284.44
      44.031     0.996875         1993       320.00
      44.031     0.997266         1993       365.71
      44.063     0.997656         1997       426.67
      44.063     0.998047         1997       512.00
      44.063     0.998242         1997       568.89
      44.063     0.998437         1997       640.00
      44.063     0.998633         1997       731.43
      44.063     0.998828         1997       853.33
      44.063     0.999023         1997      1024.00
      44.063     0.999121         1997      1137.78
      44.063     0.999219         1997      1280.00
      44.063     0.999316         1997      1462.86
      44.063     0.999414         1997      1706.67
      47.871     0.999512         1998      2048.00
      47.871     1.000000         1998          inf
#[Mean    =        3.860, StdDeviation   =       12.045]
#[Max     =       47.840, Total count    =         1998]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  3000 requests in 30.01s, 477.68KB read
Requests/sec:     99.98
Transfer/sec:     15.92KB